Revit 2026 API

# CompoundStructureGetRegionEnvelope Method

---

Gets the envelope that a specified region spans.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public BoundingBoxUV GetRegionEnvelope(
	int regionId
)
```
```vb
Public Function GetRegionEnvelope (
	regionId As Integer
) As BoundingBoxUV
```
```cpp
public:
BoundingBoxUV^ GetRegionEnvelope(
	int regionId
)
```
```fsharp
member GetRegionEnvelope :
        regionId : int -> BoundingBoxUV
```

#### Parameters

regionId Int32
     The id of the region.

#### Return Value

BoundingBoxUV The envelope of the region.

| Exception | Condition |
| --- | --- |
| ArgumentException | It is not a valid region id. |
| InvalidOperationException | This operation is valid only for vertically compound structures. |

This envelope indicates the external boundary of the region. The coordinate system it defines is used in the results of GetSegmentCoordinate().

#### Reference

CompoundStructure Class

Autodesk.Revit.DB Namespace